Documents/ESB/ESB_Consumer_0529/003TestSample/SAMPLE_XML_MUST/DepositAccount/DA29_AcctClsRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/DepositAccount/AcctClsRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>DepositAccount</ServiceDomain>  
      <OperationName>AcctCls</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:AcctClsRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>DA29</v11:TxnId>  
        <v11:TxnNo>DA2900001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <!--Optional:-->  
        <v11:ValidateOnly>false</v11:ValidateOnly>  
        <v11:ArrngId>NEW</v11:ArrngId>  
        <!--Zero or more repetitions:-->  
        <v11:CustRec></v11:CustRec>  
        <v11:ProdName>AC.DCS</v11:ProdName>  
        <!--Optional:-->  
        <v11:Ccy>TWD</v11:Ccy>  
        <!--Optional:-->  
        <v11:RsnCode>Open DCS AC</v11:RsnCode>  
        <!--Optional:-->  
        <v11:MainAcctNo>88691223344556</v11:MainAcctNo>  
        <!--1 or more repetitions:-->  
        <v11:SettlemInfo> 
          <v11:CrAcctFlg>YES</v11:CrAcctFlg>  
          <!--1 or more repetitions:-->  
          <v11:RefInfo> 
            <v11:CrAcctNo>88640000000119</v11:CrAcctNo> 
          </v11:RefInfo> 
        </v11:SettlemInfo>  
        <!--Optional:-->  
        <v11:IPAddr>IP.172.20.15.192</v11:IPAddr>  
        <!--Optional:-->  
        <v11:DevNo>1</v11:DevNo>  
        <!--Optional:-->  
        <v11:EntryDeptCode>N01</v11:EntryDeptCode>  
        <!--Optional:-->  
        <v11:PrftCntr>N01</v11:PrftCntr>  
        <!--Optional:-->  
        <v11:CostCntr>N01</v11:CostCntr>  
        <!--Optional:-->  
        <v11:AuthEmpId>HELEN</v11:AuthEmpId>  
        <!--Optional:-->  
        <v11:EntryEmplNo>string</v11:EntryEmplNo>  
        <!--Optional:-->  
        <v11:VerName>AA.ARRANGEMENT.ACTIVITY,AA.API.NEW.NCB.1.0.0</v11:VerName>  
        <!--Optional:-->  
        <v11:EcoUnit>N01</v11:EcoUnit>  
        <!--Optional:-->  
        <v11:APIKey>NCB-IF01009</v11:APIKey>  
        <!--Optional:-->  
        <v11:MobLang>ENGLISH</v11:MobLang> 
      </v11:ServiceBody> 
    </v11:AcctClsRq> 
  </soap:Body> 
</soap:Envelope>
